# 1. 데이터 구조, 결측치, 중복치 확인

import pandas as pd

# 정확한 전체 경로를 사용해 CSV 불러오기
df = pd.read_csv("C:/Users/user/Desktop/men_fashion_2026naver_blog/1_데이터 수집/naver_blog_men_fashion_2025_grouped.csv")

# 1. 데이터프레임 정보 확인
print("🔎 [1] DataFrame 정보 (info):")
print(df.info())
print("\n" + "="*50 + "\n")

# 2. 결측치 확인
print("🧹 [2] 결측치 확인:")
print(df.isnull().sum())
print("\n" + "="*50 + "\n")

# 3. 중복 데이터 확인
print("🔁 [3] 중복 데이터 확인:")
print(f"중복된 행 수: {df.duplicated().sum()}")
-----

# 2. 그룹별 데이터 수 시각화 

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

df = pd.read_csv("C:/Users/user/Desktop/men_fashion_2026naver_blog/1_데이터 수집/naver_blog_men_fashion_2025_grouped.csv")

# 시각화 스타일 설정
sns.set(style="whitegrid", font="Malgun Gothic", rc={"axes.unicode_minus": False})

# 그룹별 데이터 수 계산
group_counts = df['group'].value_counts().reset_index()
group_counts.columns = ['group', 'count']

# 막대그래프 그리기
plt.figure(figsize=(10, 6))
sns.barplot(x='group', y='count', data=group_counts, palette='Set2')

plt.title("👔 2025년 남성 가을 패션 - 그룹별 데이터 수", fontsize=15)
plt.xlabel("그룹")
plt.ylabel("데이터 수")
plt.tight_layout()
plt.show()

------

# 3. 날짜별 데이터 수 시각화

import pandas as pd
import matplotlib.pyplot as plt
from matplotlib import font_manager, rc

# 한글 폰트 설정 (Windows 기준)
font_path = "C:/Windows/Fonts/malgun.ttf"
font = font_manager.FontProperties(fname=font_path).get_name()
rc('font', family=font)

# CSV 파일 불러오기
df = pd.read_csv("C:/Users/user/Desktop/men_fashion_2026naver_blog/1_데이터 수집/naver_blog_men_fashion_2025_grouped.csv", encoding='utf-8-sig')

# 날짜 컬럼 datetime 타입으로 변환
df['postdate'] = pd.to_datetime(df['postdate'])

# 날짜별 데이터 수 집계
daily_counts = df.groupby('postdate').size()

# 시계열 그래프 그리기
plt.figure(figsize=(12,6))
daily_counts.plot(marker='o')
plt.title('날짜별 블로그 데이터 수')
plt.xlabel('날짜')
plt.ylabel('데이터 수')
plt.grid(True)
plt.show()

-------

# 4. title +description 상위 50개 명사 출력(불용어 리스트 추가를 위해) 

import pandas as pd
from collections import Counter
import re

# 1. 데이터 불러오기
file_path = "C:/Users/user/Desktop/men_fashion_2026naver_blog/1_데이터 수집/naver_blog_men_fashion_2025_grouped.csv"
df = pd.read_csv(file_path, encoding='utf-8-sig')

# 2. 텍스트 합치기 (title + description)
texts = df['title'].fillna('') + ' ' + df['description'].fillna('')

# 3. 전처리 함수 (특수문자 제거, 소문자 변환)
def preprocess(text):
    text = re.sub(r"[^가-힣a-zA-Z0-9\s]", " ", text)
    text = text.lower()
    return text

texts = texts.apply(preprocess)

# 4. 토큰화 및 불용어 제거
stopwords = set([
    '남자', '가을', '패션', '코디', '2025', '2026', '입니다', '있습니다', '같습니다', '한', '더', '을', '를', '이', '가',
    '으로', '하다', '때', '수', '등', '및', '하고', '에서', '이다', '되다', '것',
    '안녕하세요', 'com', '프로모션코드', '프로모션', '알리', '할인코드',"를",
    '여자', '여성',
    '이번', '있는', '특히', '함께', '좋은', '바로', '같은', '더', '또한', '또',
    '그', '저', '나', '우리', '때문','아래', '위', '때', '부터', '까지',
    'fw', '25fw', 
    '안', '좀', '더', '잘', '잘', '너무', '그리고', '하지만', '또한', '또', '하지만',
    '싶다', '같다', '되다', '이다', '했다', '합니다', '있다',
    '트렌드', '컬러', '추천', '9월', '스타일', '데일리룩', '겨울', '브랜드',
    '가을패션', '남성', '신상', '아이템', '시즌', '모음', '컬렉션', '무드',
    '여름', '다양한', '가장', '오늘은', '요즘', '쿠폰코드', '완성', '화보', '정보',
    '후기', '혜택', '서울', '할인', '8월', 'ddnyjkd', '최신본', '09', '있어요',
    '회원가입', '없는','많은','아니라', '이제', '어떤','원피스','정말','최신', '리뷰',
    '총정리','동시에','새로운','모두', '이렇게','https', '많이','25', '에는','출처','완성하는', '진짜',
    '지금','블로거', '오늘', '송혜교','싶은','스타','최신버전','제가', '싶은', '공개', '완벽','핵심', '역시', '이런','무신사','테무',
    '필수','최근','쇼핑', '마리떼','입는','저는','아이템이','사랑하는','없이','다가오는',
    '올해', '배우','사진','활용','하면','착용','매치하면','분위기를','스커트','먼저',
    '준비', '단순히','입기','통해','축제','zip','가이드','완성한','해시태크','블로그',
    '나는','다시','세트','위한','가능한','신선한','가지','매장','활용하기','나만의',
    '9일','7월','센스','신규','이유','키워드','세일','넘어','따라',
    '프랑소와','네이버','꿀팁','입고','착장','가격','2025남자','여신','계절별',
    'best','은은한','같아요','다른','가능','특징','편안한','카페','특징','차정원',
    '정준원', '분석','연출','덕분에','하는','기사','여기에','맞는','겨울에','6일',
    '호호입니다','아직','두빗살롱2호점','산본미용실','포인트를','그냥',
    '날씨','있어','착용한','알리익스프레스','눈에','나의','미용실','옷가게','담은',
    '내가','필수템','분들에게','사계절','선보인','소개해','하나','구매','더욱',
    '아이템으로','오픈','되면','위해','자주','직접','하나로',
    '모든','지난','골라','세금','한소희','고민','에도','다들','12','친구','있어',
    '한층','한국','물론','그래서','제품','필요한','바람이','환불','알리에서','최대',
    '좋아하는','않은','미리','발매','보는','옷장','공식','보면','배송기간','구매방법',
    '08','사실','단점','언어','주문','직구','정석','출시','여름이','근데','소지섭',
    '가입','the','보세요','관련기사','언제나','오늘의','00','쿠폰','단독','높은',
    '맞이','국내','고윤정','연출할','드디어','click','세계','8일','좋을',
    '충분히','무스','4일','맛집','더보기','주는','이미','코치','알리바바','벌써','리뉴얼',
    '같이','원래','앞두고','위에','최강희','입어도','아이돌','확실히','화보를','분들이',
    '여기서','누구나','겨울코디','제대로','좋습니다','요약','갖춘','랑방블랑','부담',
    '편안함과','제니','이건','멋진','찾는','어울립니다','이번에','크리에이터',
    '윤슬','김나영','윤슬','함께한','잡은','gq','어떻게','살짝','copyright',
    '저도','가볍게','좋고','실패','계절감을','14','협업','거예요','자리','떡볶이',
    '성수','특별한','입을','트렌드와','다음','gola','트렌드의','특유의','어울려'
    '당신의','매력','절대','코드','공개된','3개','운세','이미지','대한','정리','입으면',
    '기온','11월','겨울엔','주말','않고','완성할','000','아이콘','싶다면','마무리','all',
    '찰떡궁합','여러','이영애','할인쿠폰','이벤트','계절이','선택한','알고','all','어울림',
    '04','느껴지는','조선일보','여전히','07','속에서도','이제는','합정','때문에',
    '사기','추천드리고','신세계백화점','특가','보다','번째','아닌','000원','구제',
    '저녁','크게','news','룩에','멋스럽게','들이','다가올','오늘도','시작','차이',
    '입지','다가오고','좋아요','시즌의','해도','사면','계열의','브랜드의','2010',
    '돋보이는','어떨까요','내내','이어','떠오르는','훨씬','벌써부터','네일아트','예능',
    '방법','라이프','장원영','단연','고민하는','미리보기','미국','드라마','소프트', '남자', '가을', '패션', '코디', '2025', '2026', '입니다', '있습니다', '같습니다', '한', '더', '을', '를', '이', '가',
    '으로', '하다', '때', '수', '등', '및', '하고', '에서', '이다', '되다', '것',
    '안녕하세요', 'com', '프로모션코드', '프로모션', '알리', '할인코드',"를",
    '여자', '여성',
    '이번', '있는', '특히', '함께', '좋은', '바로', '같은', '더', '또한', '또',
    '그', '저', '나', '우리', '때문','아래', '위', '때', '부터', '까지',
    'fw', '25fw', 
    '안', '좀', '더', '잘', '잘', '너무', '그리고', '하지만', '또한', '또', '하지만',
    '싶다', '같다', '되다', '이다', '했다', '합니다', '있다',
    '트렌드', '컬러', '추천', '9월', '스타일', '데일리룩', '겨울', '브랜드',
    '가을패션', '남성', '신상', '아이템', '시즌', '모음', '컬렉션', '무드',
    '여름', '다양한', '가장', '오늘은', '요즘', '쿠폰코드', '완성', '화보', '정보',
    '후기', '혜택', '서울', '할인', '8월', 'ddnyjkd', '최신본', '09', '있어요',
    '회원가입', '없는','많은','아니라', '이제', '어떤','원피스','정말','최신', '리뷰',
    '총정리','동시에','새로운','모두', '이렇게','https', '많이','25', '에는','출처','완성하는', '진짜',
    '지금','블로거', '오늘', '송혜교','싶은','스타','최신버전','제가', '싶은', '공개', '완벽','핵심', '역시', '이런','무신사','테무',
    '필수','최근','쇼핑', '마리떼','입는','저는','아이템이','사랑하는','없이','다가오는',
    '올해', '배우','사진','활용','하면','착용','매치하면','분위기를','스커트','먼저',
    '준비', '단순히','입기','통해','축제','zip','가이드','완성한','해시태크','블로그',
    '나는','다시','세트','위한','가능한','신선한','가지','매장','활용하기','나만의',
    '9일','7월','센스','신규','이유','키워드','세일','넘어','따라',
    '프랑소와','네이버','꿀팁','입고','착장','가격','2025남자','여신','계절별',
    'best','은은한','같아요','다른','가능','특징','편안한','카페','특징','차정원',
    '정준원', '분석','연출','덕분에','하는','기사','여기에','맞는','겨울에','6일',
    '호호입니다','아직','두빗살롱2호점','산본미용실','포인트를','그냥',
    '제법','산본','보여준','멋을','해요','2041','connection','공연','내돈내산',
    '환절기','빛나는','대박','10월','돌아온','경서','벤투스','그대로','놓칠','여유로운',
    '마음에','기준','이나','제일','그것이','않는','다양하게','www','만날','띄는','주고',
    '아무래도','들고','그런','들어','시즌을','계절의','프로','일정','준비하는','있을',
    '정해인','스포츠','추석','방송','컬렉션도','엔폴드의','별자리','부산','있는데요',
    '쓰는','권은비','쇼핑하자','26','25년','쉽게','있게','휩쓴','승경이','잇템은',
    '보니','취향','이라는','한정','키워드는','오래','플라워','유튜버','week','이대로',
    '있었는데','아닐까','영감을','시간','관리','온라인','인터넷','아이템','주목해야',
    '오랜만에','않게','편한','프리뷰','빼놓을','여자코디','매일','나만','추천하는',
    '쇼룸','등이','초특가로','효민','되는','여름에는','카테고리에서','c라인',
    '주목받는','따뜻하고','100','선택','프로그램','멋지게','가능합니다','완성해',
    'chair','혹은','fall','빠르게','방문기','로미데이입니다','린컴퍼니',
    'tip','코리아','근황','있는데','넣어','더해','듯한','르세라핌','됩니다','05',
    '70','겨울에는','글에서는','가지고','바이린샵','제안','가운데','다음으로','여러분은',
    '완전정복','안유진','아이템입니다.','아주','느낌이','아니면','계절에','자외선','날씨가',
    '챕터','동안','여행용','sns','하나면','관련','대표','이게','스테디셀러까지','유행템부터',
    '유행템을','텅장','타선','거를','그럼','전주','결국','완전','브랜드로','팝업',
    '쇼핑은','22','완성해보세요','발매된','실제로','소비','여유','전반에서','아트',
    '차단','20','기록','느낌으로','양주','천일홍','팝업스토어','올해도','클릭','헤지스',
    '추천템','특히나','즐거운','쇼핑몰','활용도','있다면','결혼식을','소개드릴','빠질','시장',
    '여자데일리룩','셀럽들이','아이템입니다','reserved','없을','구두','센터','찰떡',
    '중단발','뉴욕','좋더라고요','맟춰','블랙야크','순위','합리적인','평소','enfold',
    '본점','말이','temu','골드','이야기','즐기는','여름과','인상을','naver','미친',
    '단독으로','right','에서는','성한빈','되어','더한','관심을','대신','보여주는','강남',
    '스타킹','허리','가는','선선해진','투어리스터','주어','출근','계속','현재','분들께',
    '스타일링팁','안에','up','프린트','더더욱','주목','영국','하루','김우빈','ep',
    '고현정','사랑받는','만나볼','쿠폰팩','개인적으로','물씬','찾고','분들은',
    '다행이야','것도','친구가','23','엔드','사람','영화','이탈리아','문화','포인트로',
    '하나가','in','싶습니다','여러분의','하나만','갖고','한눈에','필수템으로','조인성',
    '클로딩','아이템들을','바람막이는','19','신제품','본격적으로','전에','시선을',
    '받고','제품은','에센셜','속에서','또는','피레티','다운','김채원','과하지','jpg',
    '여기','언론사제공','운동','여자연예인','남은','해서','많아서','오오티디','귀여운',
    '인사이트','편하게','만한','기간','환급','이날','최고의','성우','디자이너',
    '동네','시그니처','분들','실용적인','oslo','웃겨주는','어느덧','성지','사로잡은',
    '눈을','시즌이','처럼','드레스','외에도','제품들은','파트','초콜릿','중간','우리는',
    '농구화','님의','29일','만나는','피부','무료선물','가볍고','편안하면서도','날씨에',
    '완성템','단발','어울려요','슬슬','모였어요','어깨','브릭','말고','16','메인',
    '과도','회사','보셨다면','변신','머리에서부터','look','재방송','보고','soeul',
    '만큼','대용량','근교','feat','라인업','추천인코드','기능을','잠시','라운딩',
    '하머니','김희선','안재현','깊이','전현무','참견','전지적','주인공','장바구니',
    '주우재','살리는','관심이','해외','스타그램','vs','seoul','분들이라면','할머니',
    '산본역미용실','주목받고','조던','마세요','개인의','아시나요','ugg','시점',
    '여자들이','단숨에','평균','아이콘이었던','당대','선수이자','전세계를','1920년',
    '얼굴형','솔직','디자이너브랜드','약간','주목할','광저우','절제된','목요일','선물',
    '야외','분위기에','이하','29','베스트셀러','김영광','기능성을','신림','의자',
    'by','유튜브','해결','만든','야토언니입니다','나린','무드로','추천합니다','셔츠추천',
    '올리브영','페스티벌','가격으로','363회','지그재그','나온','전문','생각보다',
    '예요','다채로운','실용성을','30','시에','키즈','변화를','착샷','있답니다','코스',
    '느낌의','가격도','시작돼요','비교','맞게','사람이','blog','이중','시즌은',
    '인상적이었어요','정보를','산본미용실추천','sp','새롭게','이민정','7일',
    '탄산마그네슘','올해는','ashwini','도화살','종류','않나요','몽벨','등을',
    '긴생머리','썬캡','프리미엄','레전드','best5','처음','이거','ss','제작되어',
    '지우','참고해','크로셰','놀거리','new','셋업','한번','싶어요','하며','취향에',
    '글은','롱스커트','5일','인천','런웨이','자체가','컬렉션에서','마치며','이야기를',
    '가득한','만나요','테마는','라이프스타일','하반기','남친','여배우','대해','하나는',
    '하늘','있었어요','5가지','앞으로','보러가기','상품','기대해주세요','강한','마다',
    'motch','이미지를','협찬','수지','사람들','잡는','일반','슬릭컷의','어울리고',
    '소식','간단한','리버시블','해외살이','강국인','우리나라가','로바다입니다',
    '하기','심플하면서도','남성용','아시아','오후','어때요','여러분','중심으로',
    '청담','나들이','추억','가서','광고','있으니','비밀','2024','속에','중에',
    '스튜디오','무난하게','있으면','라코스테라면','옳습니다','해외살이를','금쪽같은',
    '김해','시원하게','날이','버릴','핸드백','입기좋은','생각이','되고','얼마나','남성복',
    '헤어추천','와도','발표','03','괜찮고','더하면','갑니다','신예은','사운드','가수',
    '젤네일','예물','인기를','한정판','노홍철','경제','2시간','만나','제품명','적당한',
    '지나고','펄스','끝판왕','찾으시는','언제','신세계','미니스커트','좋게','aw',
    '마스크','실제','항상','헤지스의','풀오버','젤리멜로','제공','고마워','무조건',
    '잊지','기대되는','신경','가기','on','드라이브','발매일','위주로','최종','핸들',
    'mousse','klpga','관심','손질만으로도','one','아이브로우','섀도우팔레트','나스블러셔',
    '키스미아이라이너','글로스','롬앤글래스팅','정보는','전지현','확실한','분들도',
    '들의','전통적인','예약','아이템이랍니다','생각에','사랑은','년9월7일',
    '것을','오늘의 코디','친구와','오전','봄날','화장품','갔을','변하는','구입',
    '업계','모습으로','mary','아름다운','파라슈트','쿠폰코드입력','엄마옷',
    'erer','독보적인','지수','센스있는','쇼에서','놓치면','활용하면','입어','시눈',
    '같고','쌀쌀한','진화','수량','아이브','맞아','되세요','품번','전국','때가',
    '헤드라인뉴스','지속','예를','했는데','it','찰떡궁합입니다','빨리','라이브',
    '위시리스트로','아이템과','있지만','봄코디','전작보다','g2','골퍼들이','구로',
    '구로동','릴리코츠','조용한','담아낸','정석을','박민영','utmb','top3','장도바리바리',
    '마치','영어듣기평가','2회','2학년','중학교','방송일자','혹시','도심','위장',
    '착용하기','노스페이스에디션','주를','시리즈','라고','hyetnee','14일','pick',
    '깔끔하면서도','캐릭터','어느','지프','캘러웨이어패럴','여름의','드릴게요',
    '맞물려','이라','에르에르','아는','군더더기','1개','해주는','알로','강추',
    '불어오는','라인','테마','때마다','없죠','컬렉션으로','사고','unframed',
    '챙길','스커트를','귀환','40','잠깐','제발','캐미솔브라','사진이','이면','컬이',
    '하이','us','믹스','힐피거','원하는','할인률','어울리며','넘어가는','전체적으로',
    '주며','은은하게','me','준비해','싶었는데','소개합니다','시즌마다','패밀리세일',
    '응모링크','클레멘타인','og','언디피티드','언디핏','chance','golden',
    '열린','골프모자나','비법','아이템들이','원피스와','안녕','드려볼까','리얼리즘',
    '하이퍼','차정원의','어울릴','버커루','것은','규모','장하오','포토월','어디든',
    '앰버서더','밴딩','감성이','2일','osen','혲니','쿠팡','털보형제들','24','확장',
    '90','입어보니','계절을','롯데백화점','신상품','으로도','예쁘게','계신가요','sie',
    '바람','예뻐서','테마로','마지막','남아','개최','한복','맛집이에요','깊고','컬렉션이',
    '이해','궁금하다면','달라지는','천재지','퍼포먼스였따','밴드라고','불모지',
    '같아진다','레쮸고','활용하여','매장에는','골프장의','하면서도','젤센디바이스',
    '차분하면서도','체리','홍대','손색이','전체적인','독특한','아빠들의','시작된',
    '야구','k2','들어간','등산','한편','50','링크','그래도','기업','엄청','워터밤',
    '망고','women','갈린','호불호','참사','천재적','마법의','박보검','900원','편집샵',
    '예쁘고','정리해드릴게요','소개해드릴게요','last','다만','탤런트','보이고','깊은',
    '이는','이러한','여름에서','제안하는','인기템','coupang','link','이걸로','남성영',
    '분들을','어울려서','매우','최고','맞춤','이질감이','살려줍니다','네이버이미지',
    '골퍼들','소품과','계의','달샤벳','어디에나','에샤페','그는','인생','보이게','패뷰페',
    '1911','보여주고','만나보세요','정리해','앞에서','미시','무대','소화하며','감각을',
    '봄에는','손이','여성용','적당히','싶을','푹쉬면','products','변화','여친','편하고',
    'free','리본','alo','프로그램명','돌싱글즈','riomeu','리오므','데프가먼츠',
    '주면','모아본','바람막이보단','10일','골프화는','야무진','등장한','성수동',
    '감사합니다','하이레이어드컷','레깅스','사는','시즌에는','대구','여자운동화',
    '김포현대아울렛','보이즈2플래닛','금천','추천드려요','민서','가볼만한곳','ddp',
    '생활','아니','아르마니','my','고민이','변우석','지난달','asure','옷장을','콜라보',
    '화보는','봄여름','요가','마시모두띠','드러내는','여신룩','아님','신을','가득',
    '골지','단계','골지','jch7777','포스팅을','입히기','옷장에','당신','펼쳐지는','고급','오기전에',
    '데이트에','촉촉한','이지','남편이','네이버헤어블로그','헤어디자이너추천','공홈에서는',
    '길에','공홈과','아이디어','드론','알려져','이쁜','하프','200','지역','전시','참석한',
    'to','참고로','보시지요','한참','닫고','매력의','보스턴','옴므','에게','떠오른','국제',
    '에어엑스워치시계','미밴드','샤오미미밴드7','애플워치7나이키','애플워치7스타','사복여신',
    '랑방블랑25fw','ib8169','슈리입니다','객리단길','모델로','사랑을','얀시','써도',
    '중심','재해석한','추천해요','명품향수','코롱','년9월5일','들도','햄버거','박사',
    '새로','메이저','자리에서','블챌','시작하는','자칫','있다는','정치','아이템으로도',
    '않을','선보이며','브레이커','경쾌한','코브마스터','작업','12일','채널','네온','nike',
    '제니가','고급스러우면서도','신는','클래식과','클래식하면서도','송혜교처럼',
    '11','객사','논란','브리핑','유통','elan','jane','대운을','건강한','이상이','사이에서',
    '챙기고','이청아','모아보기','위치','중이에요','autumn','차은우','바로가기','라코스테의',
    '가능할','블랙원피스','올해의','눈길을','코디모음','입어보기','역대급','ive',
    '소화','이상으로','3차','장원영x로라로라','와이드앵글','돋보이게','1위','엄마',
    '어스','살릴','현장에서','강력한','무신사추천템','업스타일추천','분위기헤어',
    '사랑이','촬영','숨겨진','결혼하고','레시피','자리를','원피스의','브랜드와',
    '조금씩','사입대행','alea','단풍','빠른','하안동골프','가산골프','광명골프레슨',
    '광명골프연습장','개인레슨','골프레슨','여자프로','완성되는','디자이너의','점이',
    '않을까','주인공이','버전','키워드가','레끌라','란모','coupon','일환으로','활동의',
    '비바이아','백투스쿨','표현','끝나지','두쏠아이','결혼을','실착','흐르는','하게',
    '프렌치','보통','무료','캠핑','신기','전략','완성은','태그','싱글','인터뷰','얻어가세요',
    '시작되면','도시적인','있으며','페스타','60','오는','코스트코','패러슈트','제품으로',
    '플래그십','마인드브릿지','최근에는','잡아라','우나드모나코','포근한','장착','오면',
    '기념','타이밍이','예시','골프웨어는','활용성','소개한','지금이','파격','볼게요',
    '모음집','만난','제철','배송','시작한','읽어','3대','summer','펌추천','맞아서',
    '신선해지는','민감한','예쁨','트렌드에','느낄','버스킹','긴머리','여자헤어스타일추천',
    '빛내줄','문을','노하우','shell','뻗치거나','계에서','제작','티아라','하우스',
    '플레임','계를','이어지는','김유정','세리','확인해보시면','vivaia','올라','피플',
    '학생','결혼','이진욱','파르테노페','그의','유독','여자리프컷','앞에','사주','친구랑','후르츠',
    '않으면서도','미용','로우','열리는','강화','3일','캐나다에','차준환','홈에서','혲니의',
    '것입니다','별주','드릴','특선물','없어요','미쳤다','그녀의','좋아합니다','스와로브스키',
    '소화활','활용해','korea','생각하는','주로','시작은','받아','포켓','사람들이','잇템',
    '손끝','소식을','카테고리','기분','와플','다음과','스토어','열심히','만나보았습니다',
    '봄과','고성희','박영라','박정연','베네타','노는','달라붙음','비와서','있겠슨',
    '감기세요','개강증후군인가','친구나','기본템','저랰','디폴트값이야','한국인','깊이감',
    '몸을','시즌인데','초이고','남녀','제안할까','구상한다면','날씨의','대한민국',
    '아이템이에요','경제와','꽃구경이','펼쳐져','억새','천일홍축제','연예인머리','짧은머리',
    '스타일링과','계절에는','남성분들에게도','스타일링에','위크에','가릴','할리우드','소재가','유도연',
    '좋아','내용','소식이','시기','완전히','삼성','담아','남겨놓았습니다','좌표','여행꿀팁',
    '잡을','하나쯤','매번','중고','청량','조이','옷들이','선택하는','제공받습니다','수수료를',
    '곡선과','motion','modernity','미우미우맛','꼽히는','제품들이','에트로','얻고','반드시',
    'nj3nr56','구김없는','hilfiger','분야','의상을','kr','했던','쇼핑을','무대에서','블로그에',
    '오늘뭐입지','순간','가격대','주방','900','지금부터','상반기','런던','없습니다','라는',
    '음악','닮은','제씨킴입니다','인기가','조화롭게','난리난','잘산템','옷추천','에비너',
    '생각','수영복','성숙함','아니다','적용','4층에','z세대','정점','2차','거울','알아보기',
    '비해','쇼핑엔','잡았어요','하이브리드','포인트는','깔금','가져왔습니다','핫트렌드',
    '준비되어','기능성과','신부','과연','넘치는','강아지','17a','분들까지','가지기',
    '분들부터','신상으로','어울리네요','클라인','법한','바뀔','자켓추천','공개했습니다','7회',
    '년까지','옆에','먹으면','얼굴','이태란','de','삼겹살','엄지척은','가욥','가취','간다',
    '길을','하이라이트염색','문구','되기를','성수기','소개하며','프로모션을','넘나드는',
    '아이템인','되기','중에서','매력적인','예복으로도','핵심은','출근룩을','자신의','꾸미지',
    '13','졸업','대학','나여추','웨더아이','단풍시기','존재감','외출','토론했다','못한대서',
    '갱이는','상수역','되나','장사가','포토그라피','교수님의','대비','아닙니다','교과서',
    '아이디어와','입점','옷차림에','태블릿','u204lmma','댓글에','반영한','링을','딱인',
    '님은','대충','농구','공예','그녀는','포함','않지만','행사에','하겠습니다','전혀',
    '단정','휴양지','이처럼','타고','중국언론','착용할','프로파일','티미','드롭','중인',
    '폭발','꾸준히','아이템들','산책','100주년','도전해보세요','item','파격적인',
    '4월','아이','웨이브','랩원오원','같아서','쿠폰번호','추워진','iconik','제로베이스원',
    '찾으신다면','도전해','나에게','마지막으로','며칠','미디','여름을','드린','중요해요',
    '뭔가','잇님들','둘러보기','대세','등등','men','인데','대방출이에요','리더라면','속보',
    '긴급','윈터','착한','참고하기','선선해지는','년9월6일','봉태규의','세르지오','현재는',
    '4가지','winter','파자마','더비','15','옷잘알','트렌드인','선택이','오귀','spirit',
    'jeep','메리제인은','김수현','우선','쇼를','무대와','소년미와','흐름이','선보이는','본점에서','였어요',
    '버킷햇으로','fluke','기다리던','핫하게','반값','다음은','살린','작년에','인플루언',
    '중년','준비하기','서면','마음이','만드는','스코어를','맨즈','lee','망고매니플리즈','오래오래',
    '반품','반려견','저녁으로','가격까지','완성됩니다','로맨틱한','상징','고윤정의',
    '사진과','착용샷','한지우','모델과','청순','자랑하는','센텀','센텀미용','사진은',
    '여자들은','동작을','투구','초반에','껄렁거리는','못하고','진지하지','야구공을',
    '매주면','cent','10만원대선물','살해했다는','찔러','목을','일본에','샊히야','마라',
    '더럽히지','뉴욕에서','향기가','옷들','건축','경북','원형','컬처','상의와','코스모스',
    '핑크뮬리','양주나리공원','양주축제','여름헤어추천','저자','라인을','9060','컬렉션의',
    '행사','gif','야노시호와','유튜브쇼핑','여자오버핏','살들을','코디팁','오피스룩부터','디자인도',
    '시작되는','코디도','타낫','고민되는','시스템','28일','때는','허쉬컷','주우재의','you',
    'pf','루카','키워드로','손끝에','색상은','쇼핑의','meovv','루이까또즈','미야오','무대에',
    '활발한','28','공존하는','감성으로','가능하며','창의력을','75','큐레이터','자라코디','무더운','맞이하는',
    '고급스럽고','여러분들은','강력','브랜드인','모르는','같았던','공기','해보세요','일자','보입니다','겨울신발',
    '경험해','활동성','대회','612회','앞으로도','정교한','시즌2','경험한','영화제','트렌드한',
    '출시되어','대상','실용성','tv','중국발','takechanceandfortune','기반으로','아이유',
    '59','없고','사회','3가지','쇼츠','타키니','암튼','데일리룩에도','insight','industry',
    '업계동향','태산','말숙','트웰브','시대를','캄파나','속의','드리려고','음악과','카고브로스','그녀가',
    '별로','노윤주의','야경','더바넷','초겨울까지','찰떡궁합인','일상에서','쓰리피스수트','가격은',
    '받은','현장','오랜','절반은','백이','이벤엔','옷코디','재미있게','편안함을','추천을',
    '와우할인','엄정화','남겼었던','8번','2023년부터','해운대','아이디어를','매장에서','다소',
    '첫째주','간절기아우터','깔끔','레전드를','17a','눈이','코앞으라서','추석도','지엘입니다',
    '추천인코드까지','추천부터','품절템','타이틀리스트','아마','남친룩추천','이상이의',
    '어치브','xl','여자니트','더해져','지갑은','기은세','무슨','색을','이유로','투블럭','강림',
    '갱신하는','갱신','탐텐','걱정','감성적인','계절입니다','주기','컬렉션부터','달라졌습니다',
    '열리면서','29cm','더레이블','소개팅룩','80','진행','역시나','디테일의','원영','ssf샵',
    '보이즈','내외동','와이드앵글','부산미용실추천','센텀하이엔드헤어','해운대미용실','센텀미용실','쉬운',
    '자유로운','내려서','녹여','무서워서','데이트룩은','있으시죠','이에요','아우터추천',
    '리포트','54','쉽다는','등극하기','피플로','넥타이입니다','찰떡으로','우린','그래',
    '안팔아줘서','공식슬로건','안테나가','싫어했지만','향수같다며','엄마는','candle','roman','cherry',
    '즐길','맴도는','열기가','살았나','치열하게','여름동안','아우르는','저희','아시아건축사대회',
    '상상캠퍼스','아트페어','복합공연','레이저','경주에서','알린다','세계에','250908',
    '트렌드세터','알면','슈즈를','대담한','발표했다','격식','샌들과','찰떡이에요',
    '계절감','웨이','헤어스타일추','묵직한','비스크','편안하게','잡고','포기할','앤드지',
    '도움이','살펴볼','여름에','감각적이고','니트원피스','제너럴아이디어','모네온스까지','릴리코츠부터',
    '가진','best3','있다고','유행할','돌고','등극','레이스스커트코디','만나다','염색추천',
    '스커트와','걸쳐도','선택을','포레스트헤어','고의','긴머리룩','보내시길','이름만',
    '라니','글쎄','놓은','뒤집어','발칵','보기','갓성비','보머','링클프리','모음zip',
    '두루','coach','넘어서','참고하면','디테일을','높습니다','top4','같네요','발생할','구매가',
    'tngt','정리하실','꼽는','굉장히','팔레트','폴햄키즈','살려주는','허리에','서로',
    '되겠다','경량패딩을','이진욱이','겨울은','스프린트','미술','250904','날씨를',
    '현대적으로','강동원','홀터넥','배경으로','신작','갔다','3번째','클리어','일러스트',
    '내년','블로그챌린지','지켜내는','변하지','코디입니다','년에도','활용하는','5를','바람막이코디',
    '여름부터','현실','통해서','24일','플랫폼','디렉터','컨셉임','노을','뒤집어질듯',
    '방어','vacation','중이라면','살랑이는','올라가다가','셔틀','추레하다는','시험기간이었기에',
    '사진들','안올렸던','인스타에','글이다','기억하고자','추억들을','얼어','눈물마저',
    '진심이시라','그럴때','썸타기','2030','도라야끼','돌아다니다','아쉬워','예뻤더','노을이',
    '보자','공연장에서','태규야','자만추','we','준비하였습니다','가성비로','무게감','추천인',
    '체질에','기온이라도','뀰초이입니다','싶네요','물론이고','집사도','장식','여러분만',
    '코디꿀팁','25aw','준비를','해부','데이터','언젠가는','아침저녁으로','스커트코디법',
    '추천드립니다','25일','선사합니다','남성분들에게','보았어요','ddp에서','테무깡',
    '풍경','댓글로','품목','this','looking','are','무탈히','컨텐츠에서','농구동호회룩',
    '001','fq1285','스피드웨이','플리츠스커트룩','고원희의','자석젤','쿨무드','시장에서',
    '태비백','2016','투브릿지','랍니다','401','806','8741','에너지를','승마','주니어',
    'mz','매치할','준비하고','문빔은','커피머신','사이','아이템이죠','신학기','자기',
    '헤일리','블라우스와','완성하고','노스페이스화이트라벨','아이템들도','분께',
    '쓰기','투명한','결합된','w에','굿이어웰트','축복입니다','10만원대로','나혼자산다',
    '나혼산','구분','2개','한눈에보는','적절한','듣고','hongwoosung','감각','느낌이라',
    '그러나','코트와도','셋이','컬러라고','뽐내입니다','넉넉한','투명','예쁠','연출이',
    '알려주는','드론쇼','생활문화','최우식','보다가','녹음을','적합한','이어갈까','독립',
    '제국','16조','님이','파리','등장하는','함께하는','인상','서이추','실물','고르는',
    '38','왔다','인기순위','애니멀','fw스타일링','부담스럽지','유행아이템운동화','시도해',
    '출시한','커트','코앞이라서','탑텐','유센틱','스타일에도','사랑','결정','하이시간','알아보러',
    '커플이','친한','데이저스트','20대코디','네이버블로그챌린지','제5회','힐링','누구에게나',
    '코트안에','친구분','막바지에','노트에갈테야테야','노트북할','나는나는갈테야','작가',
    '아직도','마칩니다','스타일이라','mlb','아이코닉한','특징을','그렇다면','거의','사야',
    '싶은데','디즈니','도심을','세상을','노래','매일이','경험을','올림픽','예쁘다','거장',
    '합칠까','거물과','확정','상관없이','에서도','많은데','서이추환영','이랜드위크',
    '디테일과','레몬','클래식에','난항','회생절차','best4','원픽','스피릿','지효',
    '핫잇템운동화','신상운동화','각광받고','가족과','괜히','아동복','간단히','간절기쇼핑',
    '걸치기','청춘의','나쁜','변화하는','정품','없어서','위크에서','꽃챌입니다','그레이트',
    '상의는','살랑살랑','점점','소개할','모두에서','배우는','워낙','지켜요','dna','알리에서만',
    '누구보다','고객님꼐','소지섭이','왔습니다','알려드릴게요','남성의','코디에도','필드에서만',
    '업그레이드입니다','편이','숏팬츠','5대장','띠별','백로','절기','해봤습니다','시기가','캔버스',
    '스타일링의','심지어','어디꺼인지','구경가기','단정하면서','방풍','엄정화가','최고급',
    '애인도','내일은','필요하고','살아가는','엄마로서','애정운','저돌적인','운세네요','해매는',
    '홀로','산길','스산한','virgo','처녀자리','한숨','실수','우경은','케이크','얘들아','잘잇어','귀걸이셔',
    '방법이야','사진작가','완성도를','명품골프웨어','트렌드입니다','화보에서','강조',
    '간절기룩','업스타일','채널a','김해내외동옷가게','골프티셔츠','시너','단식','세상에','짧막한',
    '보냈던','가족들과','곧인','티는','시즌엔','이후','31','고민이라면','따뜻하게','위치로',
    '발랄한','웨어','입어보고','차분하고','너무나','리뷰를','164번째','8회','첫구매','함꼐하면',
    '입었을','완성도','진행된','보온','오피스룩스타일링','뿜뿜','캠페인에서는','달라집니다',
    '찰떡궁합이라서','남친룩의','gnrl','넓은','경우','활용이','선호하는','장소',
    '겨울까지','풍성하게','gemini를','내용으론','작성해','주제를','카드뉴스','압도적',
    '만족시키는','일상룩을','화보에서는','브랜드들이','김나영이','궁금한','양면','운동화가',
    '스타넥','김고은','출시일','퍼킹','까스텔바작','은근','이상이체크셔츠','뜨거운','인테리어',
    '이고','특성상','위시템','code','우리의','그릴','봉태규','나도','매력이','이유는',
    '가능해','심플하지만','셀럽들의','신제품으로','1911니트트랙','찰떡같이','누가',
    '수빈','향수순위','참석차','받는','과기정통부','중기부','소화하는','하늘처럼','다이어트',
    '전반에','둘러싼','좋아함','배가','착용된','설레는','트렌드셔츠스타일','여름휴양지',
    '고성바다','고퀄리티','상담','체크셔츠스타일','trend','시계들을','못하셨더라도','전현무코디',
    '일대','가산디지털2단지','g밸리','로맨틱하면서도','9월에','gc페스타로','g밸리에서','추웠던',
    '가득하고','그대는','웨이브가','년의','모임','착용해도','차이점','ma','스웨덴','무드에',
    '위스커','위스커','차가운','부문','예정','재킷은','한다는','기능이','바스락','교육',
    '와서','티셔츠는','리스트','하나의','사회에서','득템하세요','착용해','런웨이를','수종사',
    '관찰기','21','꼼꼼한','해외브랜드','스타킹코디','제품을','뛰어난','2022년','편안함',
    '11일','않아','이상의','등과','셀럽코디운동화','하나만으로도','봤는데요','꿀템','간절기에','여자골프의류',
    '없겠죠','랑방블랑의','과감한','치어리더','12344516966','마크','매력적으로','awards',
    '반란','나띠','9얼마','커플맨투맨','25w','공항룩에','잘해줘요','개성과','걸쳐',
    '체크스커트로','언제든','특징이','기회','경쾌하면서도','코디해','시술','소개해드릴까',
    '히피펌을','blanc','lanvin','톡톡입니다','안녀하세요','보세','헤어컷이에요',
    '이도현','새틴','폭넓은','이루는','은근히','숄더','자세히','날씨로','사진을','입기에',
    '각기','곳곳에서','이죠','바캉스룩으로도','유행예감','티비','직업','그럼에도','공간에서',
    '꾸며진','동대문디자인플라자','귀엽게','포기하지','복잡한','시세','커플셔츠코디'
    ])


all_tokens = []
for text in texts:
    tokens = text.split()
    filtered_tokens = [token for token in tokens if token not in stopwords and len(token) > 1]
    all_tokens.extend(filtered_tokens)

# 5. 단어 빈도 계산
counter = Counter(all_tokens)

# 6. 상위 50개 단어 출력
top_words = counter.most_common(50)
print("상위 50개 단어 및 빈도수:")
for word, freq in top_words:
    print(f"{word}: {freq}")

